# CornerPost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostPattern..::..CornerPost Property
PostPattern Class See Also
---
Accesses the object containing properties related to the corner post.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BalusterInfo CornerPost { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CornerPost As BalusterInfo
	Get
```

Visual C++
---
```text
public:
property BalusterInfo^ CornerPost {
	BalusterInfo^ get ();
}
```

# See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace